Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: This leads us to the following general advice: all functions taking string arguments should take const wxString& (this makes assignment to the strings inside the function faster because of reference counting) and all functions returning strings should return wxString - this makes it safe to return local variables.
ja: このことから、次のような一般的なアドバイスが可能です: 文字列を引数として受け取るすべての関数は const wxString& を受け取るべきで (参照カウンタ を使用するため、内部文字列への代入が早くなります)、文字列を返却するすべての関数は wxString を返却するべきです。(これにより、安全にローカル変数を返却することができます)

source: This macro can be used with character and string literals (in other words, 'x' or "foo") to automatic...
ja: このマクロは文字やリテラル文字列 (つまり、'x' や "foo") を Unicode ビルド時に自動的にワイド文字列へ変換します。

source: This macro is exactly the same as wxT() and is defined in wxWidgets simply because it may be more int...
ja: このマクロは wxT() と完全に同じです。これが wxWidgets で定義されている理由は、単純に標準の Win32 ヘッダでも定義されており、Windows プログラマにとって直感的だからです。(同様に、同じマクロが他の名前 (_TEXT()) でも定義されています)

source: This macro loads a bitmap from either application resources (on the platforms for which they exist...
ja: このマクロはアプリケーションリソース (アプリケーションリソースが存在するプラットフォーム、つまり Windows と OS2 の場合) または XPM ファイルからビットマップを読み込みます。

source: This macro loads an icon from either application resources (on the platforms for which they exist...
ja: このマクロはアプリケーションリソース (アプリケーションリソースが存在するプラットフォーム、つまり Windows と OS2 の場合) または XPM ファイルからアイコンを読み込みます。

source: This may not be available on non-Windows platforms.
ja: これは非 Windows 環境では使用できません。

source: This means that internally only Unicode strings are used and that, under Microsoft Windows, Unicode system API is used which means that wxWidgets programs require the Microsoft Layer for Unicode to run on Windows 95/98/ME.
ja: これはつまり、内部的には Unicode 文字列のみが使用され、Microsoft Windows では Unicode 版のシステム API が使用されることを意味します。そしてこれは Windows 95/98/ME で wxWidgets プログラムを実行する際に Microsoft Layer for Unicode が必要となることを意味します。

source: This means that you don't risk getting unexpected events from the dialog controls (which might be left unprocessed by the dialog itself because it doesn't care about them) when a modal dialog is popped up.
ja: これはつまり、モーダルダイアログを表示しているときにダイアログコントロールから意図しないイベントを受け取ることがないことを意味します。 (それらのイベントは処理されないままになるでしょう)

source: This means that you don't risk to get unexpected events from the dialog controls (which might be left unprocessed by the dialog itself because it doesn't care about them) when a modal dialog is popped up.
ja: これはつまり、モーダルダイアログを表示しているときにダイアログコントロールから意図しないイベントを受け取ることがないことを意味します。 (それらのイベントは処理されないままになるでしょう)

source: This means, that the entire behaviour of a sizer and its children can be controlled by the three parameters of the Add() method.
ja: これはつまり、サイザーと子コントロールのすべての振る舞いが Add() 関数の 3 個の引数によって制御されることを意味します。

source: This member must create and return an instance of the derived connection class if the connection is accepted.
ja: 接続を許可する場合、継承したコネクションクラスのインスタンスをこのメンバ関数で作成し、返却する必要があります。

source: This method can be used inside an event handler to control whether further event handlers bound to th...
ja: この関数はイベントハンドラの中で使用し、現在のイベントハンドラの処理が終わった後にさらにイベントハンドラを呼び出すかどうかを制御します。

source: This method is what is called by the constructor of most controls to set the minimal size and the initial size of the control.
ja: この関数はコントロールの最小サイズと初期サイズを設定するためにほとんどのコントロールのコンストラクタで呼ばれます。

source: This method is what is called by the constructor of most controls to set the minsize and initial size of the control.
ja: この関数はコントロールの最小サイズと初期サイズを設定するためにほとんどのコントロールのコンストラクタで呼ばれます。

source: This method is what is called by the sizers when determining what the requirements of each item in the sizer is, and is used for calculating the overall minimum needs of the sizer.
ja: この関数はサイザー内の各要素の要求サイズを決定するときにサイザーから呼ばれ、サイザーの必要とする最小サイズを計算するために使用されます。

source: This must be provided by the application, and will usually create the application's main window...
ja: アプリケーションはこの関数を必ず提供する必要があり、通常はアプリケーションのメインウィンドウを (任意に SetTopWindow() を呼んで) 作成します。

source: This object, in turn, sends the event to the current view and the view itself lets its associated document process the event first.
ja: そして、このオブジェクトが現在のビューに対してイベントを送信し、ビュー自身が関連するドキュメントにまずイベントを処理させます。

source: This overridable function is called when the value associated with the validator must be transferred ...
ja: この仮想関数はバリデータに関連する値をウィンドウへ転送しなければならないときに呼ばれます。

source: This overridable function is called when the value in the associated window must be validated...
ja: この仮想関数はウィンドウに関連する値を検証しなければならないときに呼ばれます。

source: This overridable function is called when the value in the window must be transferred to the validator...
ja: この仮想関数はウィンドウの値をバリデータへ転送しなければならないときに呼ばれます。

source: This overview briefly describes what the config classes are and what they are for.
ja: この概要ではコンフィグクラスとは何で、何のために使用するのかについて簡潔に説明します。

source: This represents the client application, and is used only within a client program.
ja: これはクライアントアプリケーションを表しており、クライアントプログラムの中でだけ使用できます。

source: This represents the connection from the client to the server - both the client and the server use an instance of this class, one per connection.
ja: これはクライアントからサーバへのコネクションを表しています。クライアントとサーバの両方とも、このクラスのインスタンスをコネクションごとにひとつ使用します。

source: This represents the server application, and is used only within a server program.
ja: これはサーバアプリケーションを表しており、サーバプログラムの中でだけ使用できます。

source: This section briefly describes the state of the Unicode support in wxWidgets.
ja: この章では wxWidgets における Unicode の対応状況について簡潔に述べます。

source: This section describes all environment variables that affect execution of wxWidgets programs.
ja: この章では wxWidgets プログラムの実行に影響するすべての環境変数について述べます。

source: This section describes how does wxWidgets support Unicode and how can it affect your programs.
ja: この章では wxWidgets による Unicode 対応方法とプログラムへの影響について述べます。

source: This section describes the algorithm used in detail.
ja: この章ではそのアルゴリズムについて詳しく説明します。

source: This section is strictly about performance issues and is absolutely not necessary to read for using wxString class.
ja: この章では性能に関する問題のみを取り扱っており、wxString クラスを使用するだけであれば読む必要はまったくありません。

source: This section only discusses one family of classes -- the DDE-like protocol -- but here's a list of other useful classes:
ja: この章では DDE 風のプロトコルを使用するひとつのクラス群についてのみ説明しますが、その代わりに他の有用なクラスの一覧を以下に示します:

source: This simple class allows you to chain log sinks, that is to install a new sink but keep passing log m...
ja: この単純なクラスを用いることでログ出力先を連鎖させることが可能になります。つまり、wxLog::SetActiveTarget のようにログ出力先を置き換える代わりに、新しい出力先を設定しつつ、 古い出力先にもログメッセージを渡すことが可能になります。

source: This size value is the size that the widget is currently using on screen and is the way to change the size of something that is not being managed by a sizer.
ja: このサイズの値は画面内でウィジェットが使用しているサイズであり、サイザーで管理されていないウィジェットのサイズを変更する方法でもあります。

source: This sizer in turn will query its children (which can be normal windows, empty space or other sizers) so that a hierarchy of sizers can be constructed.
ja: このサイザーは順に子コントロール (通常のウィンドウや空白スペース、他のサイザーかもしれません) に対して問い合わせを行うため、サイザーの階層が構築されることになります。

source: This succeeds or fails, depending on the server's willingness to answer.
ja: これはサーバが応答するかどうかに応じて成功または失敗します。

source: This succeeds or fails.
ja: これは成功または失敗します。

source: This task is performed by wxLogFormatter class so you need to derive a custom class from it and override its Format() method to build the log messages in desired way.
ja: これは wxLogFormatter クラスによって行われるため、このクラスを継承し、望む方法でログメッセージを構築するように Fortmat() 関数をオーバーライドする必要があります。

source: This topic describes backwards-incompatible changes in wxWidgets 3.0 compared to the last stable release.
ja: この概要では wxWidgets 3.0 と最後の安定リリースとの間の後方互換性のない変更について説明します。

source: This type is called wchar_t which stands for wide-character type.
ja: この型のことを wchar_t と呼び、wide-character type の略です。

source: This way, you can avoid a lot of class derivation, and use instances of the same event handler class (but different objects as the same event handler object shouldn't be used more than once) to handle events from instances of different widget classes.
ja: この方法を使うことで、たくさんの継承クラスを作成しなくてすむとともに、同じイベントハンドラクラスのインスタンスを異なるウィジェットクラスのインスタンスから利用することができます。 (ただし、異なるオブジェクトを同じイベントハンドラオブジェクトとして複数回使用するべきではありません)

source: This will allow your program to perform conversions between Unicode strings and ANSI ones (using wxMBConv classes) and construct wxString objects from Unicode strings (presumably read from some external file or elsewhere).
ja: これにより、あなたのプログラムの中で (wxMBConv クラスを利用した) Unicode 文字列と ANSI 文字列の変換や、(おそらく外部ファイルや他の場所から読み込んだ) Unicode 文字列から wxString オブジェクトを作成することができます。

source: This will always be the case if the string had been initially constructed from a narrow string or if it contains only 7-bit ASCII data but otherwise this conversion is not guaranteed to succeed.
ja: 文字列がナロー文字列か 7 ビット ASCII データで初期化されているのであれば、常にこの場合に当てはまりますが、それ以外の場合ではこの変換が常に成功することは保証されません。

source: This will create a text message catalog - a .po file.
ja: これにより、テキスト形式のメッセージカタログ (.po ファイル) が生成されます。

source: This will invoke your own close event handler which may destroy the frame.
ja: これにより、フレームを破棄する独自の終了イベントハンドラが実行されます。

source: This will most often mean that the programmer does not set the start-up size of a dialog, the dialog will rather be assigned a sizer and this sizer will be queried about the recommended size.
ja: これはほどんどの場合で、プログラマがダイアログの初期サイズを設定するのではなく、代わりにダイアログをサイザーに割り当て、サイザーが推奨サイズを問い合わせることを意味します。

source: This will show you the average length of strings your program manipulates, their average initial length and also the percent of times when memory wasn't reallocated when string concatenation was done but the already preallocated memory was used (this value should be about 98% for the default allocation policy, if it is less than 90% you should really consider fine tuning wxString for your application).
ja: これにより、プログラムで使用する文字列の平均長、平均初期サイズ、および文字列を連結する際にメモリを割り当てず、割り当て済みのメモリを使用した回数の割合 (デフォルトの設定では約 98% のはずですが、これが 90% を下回る場合には wxString のチューニングを本当に検討するべきです) が分かります。

source: This would indeed prevent any key events from being sent to the native control - which might not be what is desired.
ja: 実際には、これはネイティブコントロールに送られるキーイベントをすべて横取りしますが、これはおそらく期待する動作ではないと思います。

source: Three classes are central to the DDE-like API:
ja: DDE 風 API では中心となるクラスが 3 種類あります:

source: Thus UTF16 uses a variable number of code units to encode each code point.
ja: したがって、UTF16 は各コードポイントを符号化するために可変数のコード単位を使用します。

source: Thus it is important to never use 8-bit (instead of 7-bit) characters directly in the program source but use wide strings or, alternatively, write:
ja: したがって、プログラムソース内で (7 ビット文字の代わりに) 8 ビット文字列を直接しない ことが重要であり、ワイド文字列を使用するか、代わりに以下のように書いてください:

source: Thus when iterating over a UTF-16 string stored in a wxString under Windows, the user code has to take care of surrogate pairs himself.
ja: したがって、Windows で wxString に格納された UTF-16 文字列を走査するときには、自分で サロゲートペア を考慮する必要があります。

source: Thus, data is transferred from C++ variables to the dialog just as the dialog is being shown.
ja: そのため、ダイアログが表示されるそのときに C++ 変数からダイアログへデータが転送されます。

source: Thus, under Microsoft Windows, UCS-2 (simplified version of UTF-16 without support for surrogate characters) is used as wchar_t is 2 bytes on this platform.
ja: したがって、Microsoft Windows では wchar_t が 2 バイトであるため、UCS-2 (サロゲート文字をサポートしない、UTF-16 の簡略化版です) が使用されます。

source: Thus, you might view wxLogMessage() as a simple substitute for printf().
ja: したがって、wxLogMessage() を printf() の単純な代替として考えてください。

source: To add a handler object to wxBitmap, your application needs to include the header which implements it, and then call the static function wxBitmap::AddHandler().
ja: wxBitmap のハンドラを追加する場合、ハンドラクラスを実装しているヘッダファイルをインクルードし、静的関数 wxBitmap::AddHandler() を呼ぶ必要があります。

source: To add a handler object to wxBitmap, your application needs to include the header which implements it, and then call the static function wxBitmap::AddHandler.
ja: wxBitmap のハンドラを追加する場合、ハンドラクラスを実装しているヘッダファイルをインクルードし、静的関数 wxBitmap::AddHandler を呼ぶ必要があります。

source: To be a drag source, i.e. to provide the data which may be dragged by the user elsewhere, you should implement the following steps:
ja: ドラッグ元 になる、つまり、ユーザが他の場所へドラッグするデータを提供するには次の手順を実装します:

source: To be a drop target, i.e. to receive the data dropped by the user you should follow the instructions below:
ja: ドロップ先 になる、つまり、ユーザのドロップしたデータを受け付けるためには次の手順を実施します:

source: To be more precise, each event is described by:
ja: より正確には、イベントは以下の内容で表現されます:

source: To be precise, the conversion will always succeed if the string was created from a narrow string initially.
ja: 正確に言うと、最初にナロー文字列から文字列が作られたのであれば、変換は常に成功します。

source: To better explain what stated above, consider the second string of the example above; it's composed by 3 characters and the final NULL:
ja: 上で述べたことをきちんと説明するために、上記の例のふたつ目の文字列に注目してください; この文字列は 3 個の文字と終端の NULL で構成されています:

source: To change this, you need to define wxLOG_COMPONENT to a string uniquely identifying each component, e.g. you could give it the value "MyProgram" by default and re-define it as "MyProgram/DB" in the module working with the database and "MyProgram/DB/Trans" in its part managing the transactions.
ja: これを変更するためには、 wxLOG_COMPONENT として各コンポーネントを一意に識別する文字列を定義する必要があります。この文字列は例えばデフォルトで "MyProgram" を指定し、データベースを利用するモジュールでは "MyProgram/DB" に、さらにトランザクションを扱う部分では "MyProgram/DB/Trans" に再定義する、というようにします。

source: To completely change the logging behaviour you may define a custom log target.
ja: ロギングの振る舞いを完全に変更するためにはカスタムログターゲットを定義します。

source: To correct this you should use
ja: これを正しく動作させるためには、以下のようにする必要があります。

source: To create a client which can communicate with a suitable server, you need to derive a class from wxConnection and another from wxClient.
ja: 適切なサーバと通信するクライアントを作成するには wxConnection と wxClient をそれぞれ継承する必要があります。

source: To create a connection (a conversation in Windows parlance), the client application uses wxClient::MakeConnection to send a message to the server object, with a string service name to identify the server and a topic name to identify the topic for the duration of the connection.
ja: コネクション (Windows で言うところの会話 (conversation)) を作成するにはクライアントアプリケーションでサービス名 (サーバを識別します) とトピック名 (接続している間のトピックを識別します) を指定して wxClient::MakeConnection を呼び出します。

source: To create a new log target class you only need to derive it from wxLog and override one or several of wxLog::DoLogRecord(), wxLog::DoLogTextAtLevel() and wxLog::DoLogText() in it.
ja: 新しいログターゲットクラスを作成する場合、wxLog を継承し、wxLog::DoLogRecord()、wxLog::DoLogTextAtLevel()、wxLog::DoLogText() のいずれか (または複数) をオーバーライドするだけです。

source: To create a new log target class you only need to derive it from wxLog and implement one (or both) of DoLog() and DoLogString() in it.
ja: 新しいログターゲットクラスを作成する場合、wxLog を継承し、DoLog() と DoLogString() のどちらか (または両方) を実装するだけです。

source: To create a working client, the programmer must:
ja: 動作するクライアントを作成するには次のようにする必要があります:

source: To create a working server, the programmer must:
ja: 動作するサーバを作成するには次のようにする必要があります:

source: To disable the logging entirely you can use wxLog::EnableLogging() method or, more usually, wxLogNull class which temporarily disables logging and restores it back to the original setting when it is destroyed.
ja: 完全にロギングを無効化するためには wxLog::EnableLogging() か、普通は一時的にロギングを無効化し、オブジェクトが破棄される時に元の設定を復元する wxLogNull クラスを使用します。

source: To get an ANSI string from a wxString, you may use the mb_str() function which always returns an ANSI string (independently of the mode - while the usual c_str() returns a pointer to the internal representation which is either ASCII or Unicode).
ja: wxString から ANSI 文字列を取得するには、常に ANSI 文字列を返却する mb_str() 関数を使用することができます。 (これはビルドモードに依存しません。一方で、普通の c_str() は内部の表現型のポインタを返却しますが、これは ASCII か Unicode のどちらかです)

source: To give a quick example, a common question is how to receive the mouse movement events happening when the mouse is in one of the frame children in the frame itself.
ja: 一例として、よく質問される子フレーム内にマウスがあるときのマウス移動イベントの受信方法を挙げましょう。

source: To hide a window using the sizer, call wxSizer::Show.
ja: サイザーを使用してウィンドウを非表示にするためには wxSizer::Show を呼び出してください。

source: To implement non-blocking operations without using multiple threads you have two possible implementation choices:
ja: マルチスレッドを使用 せずに ノンブロッキング処理を行なうにはふたつの選択肢があります:

source: To limit logging to important messages only, you may use wxLog::SetLogLevel() with e.g. wxLOG_Warning value -- this will completely disable all logging messages with the severity less than warnings, so wxLogMessage() output won't be shown to the user any more.
ja: 重要なメッセージのみを記録するためには wxLog::SetLogLevel() に wxLOG_Warning などを指定します。こうすることで、重要度が警告未満であるすべてのメッセージのロギングが無効になり、wxLogMessage() の出力はもはやユーザに通知されなくなります。

source: To make things a bit more readable, you are also allowed to prefix the constant with 'L' instead of putting it after it.
ja: もう少しだけ可読性を上げるために、 'L' を定数の後ろではなく、前に付けることも可能です。

source: To print a wxChar buffer to a non-Unicode stdout:
ja: wxChar バッファを非 Unicode 標準出力へ出力するには次のようにします:

source: To provide extensibility, the functionality for loading and saving bitmap formats is not implemented in the wxBitmap class, but in a number of handler classes, derived from wxBitmapHandler.
ja: 拡張性のため、ビットマップ形式の読み書きは wxBitmap クラスで実装されておらず、wxBitmapHandler を継承した多数のハンドラクラスで実装されています。

source: To put it a different way, events set to propagate (See: wxEvent::ShouldPropagate) (most likely derived either directly or indirectly from wxCommandEvent) will travel up the containment hierarchy from child to parent until the maximal propagation level is reached or an event handler is found that doesn't call event.Skip().
ja: 別の言い方をすると、伝播するように設定されたイベント (参照: wxEvent::ShouldPropagate) (よくあるのは wxCommandEvent を直接、または間接的に継承したイベントです) は最大回数、伝播するか event.Skip() を呼んでいないイベントハンドラが見つかるまで、子から親へコントロール階層をさかのぼっていきます。

source: To resolve the last problem wxThreadEvent can be used: thanks to its implementation of the wxThreadEvent::GetEventCategory function wxThreadEvent classes in fact do not get processed by wxEventLoopBase::YieldFor() unless you specify the wxEVT_CATEGORY_THREAD flag.
ja: 最後の問題を解決するために wxThreadEvent を使用することができます: wxThreadEvent::GetEventCategory 関数の実装のおかげで wxEVT_CATEGORY_THREAD フラグを指定しない限り、実際には wxEventLoopBase::YieldFor() で wxThreadEvent クラスが処理されることはありません。

source: To summarize, Unicode support in wxWidgets is mostly transparent for the application and if you use wxString objects for storing all the character data in your program there is really nothing special to do.
ja: まとめると、wxWidgets による Unicode 対応はアプリケーションにとってほとんど 透過的 であり、wxString オブジェクトを使ってすべての文字データを格納するのであれば、特別なことをなにもする必要がありません。

source: To summarize, here is a brief example of how a program which can be compiled in both ANSI and Unicode modes could look like:
ja: 要点をまとめるため、 ANSI モードと Unicode モードの両方でコンパイルできるプログラムの簡潔な例を以下に示します。

source: To summarize, instead of explicitly calling the base class version as you would have done with C++ virtual functions (i.e. wxTextCtrl::OnChar()), you should instead call Skip.
ja: 要約すると、C++ の仮想関数で行うように基底クラスの関数を直接呼ぶ (つまり、wxTextCtrl::OnChar() を呼ぶ) 代わりに、 Skip を呼ぶようにしてください。

source: To summarize, using Bind<>() requires slightly more typing but is much more flexible than using static event tables so don't hesitate to use it when you need this extra power.
ja: まとめると、Bind<>() を使用すると若干コードが増えますが、静的イベントテーブルよりも柔軟性があります。そのため、この追加の効果が必要なときはためらわずに使用してください。

source: To switch scrolling adaptation on globally in your application, call the static function wxDialog::EnableLayoutAdaptation passing true.
ja: スクロールに関する適応をアプリケーション内でグローバルに切り替える場合、静的関数 wxDialog::EnableLayoutAdaptation に true を渡します。

source: To test for command events (which will probably be the only events you wish to redirect), you may use wxEvent::IsCommandEvent for efficiency, instead of using the slower run-time type system.
ja: コマンドイベントかどうか (おそらくリダイレクト対象のイベントかどうかだと思いますが) を調べるため、遅い実行時型情報の代わりに wxEvent::IsCommandEvent を使用することができます。

source: To update your code, you should provide an event table entry in your frame or dialog, using the EVT_CLOSE macro.
ja: コードをアップグレードするには EVT_CLOSE マクロを使用してフレームやダイアログ内でイベントテーブルのエントリを定義してください。

source: To use a client, paint or window device context, create an object on the stack with the window as argument, for example:
ja: wxClientDC、wxPaintDC、wxWindowDC を使用する場合、以下のようにウィンドウを引数に指定してスタック上にオブジェクトを作成してください。

source: To use an event table you must first decide in which class you wish to handle the events.
ja: イベントテーブル を使うためには、まずイベントを処理するクラスを決定する必要があります。

source: To use an ordinary function or a static method as an event handler you would write something like this:
ja: イベントハンドラとして普通の関数や静的メンバ関数を使用する場合、以下のように書いてください:

source: To use your custom log target you may either call wxLog::SetActiveTarget() with your custom log object or create a wxAppTraits-derived class and override wxAppTraits::CreateLogTarget() virtual method in it and also override wxApp::CreateTraits() to return an instance of your custom traits object.
ja: 作成したカスタムログターゲットを使用するためには、カスタムログターゲットのオブジェクトを指定して wxLog::SetActiveTarget() を呼ぶか、wxAppTraits を継承したクラスを作成して wxAppTraits::CreateLogTarget() 仮想関数をオーバーライドし、自作の特性オブジェクトのインスタンスを返却するように wxApp::CreateTraits() をオーバーライドします。

source: Top-level windows such as wxFrame will not allow the user to resize the frame above the maximum size.
ja: wxFrame といったトップレベルウィンドウはユーザが最大サイズを超えてリサイズすることはできません。

source: Top-level windows such as wxFrame will not allow the user to resize the frame below the min size.
ja: wxFrame といったトップレベルウィンドウはユーザが最小サイズ以下にリサイズすることはできません。

source: Top-level windows such as wxFrame will not allow the user to resize the frame below the minimal size.
ja: wxFrame といったトップレベルウィンドウはユーザが最小サイズ以下にリサイズすることはできません。

source: Topic Overviews
ja: トピックスの概要

source: Topic overviews
ja: トピックスの概要

source: Transfers values from child controls to data areas specified by their validators.
ja: 子コントロールからバリデータで指定されたデータ領域へ値を転送します。

source: Transfers values to child controls from data areas specified by their validators.
ja: バリデータで指定されたデータ領域から子コントロールへ値を転送します。

source: Translating Menu Accelerators
ja: メニューアクセラレータの翻訳

source: Translating menu accelerators
ja: メニューアクセラレータの翻訳

source: Translating the strings extracted in the previous step to other language(s).
ja: 前のステップで抽出した文字列を別の言語に翻訳する。

source: Translating the strings in the program text using wxGetTranslation or equivalently the _() macro.
ja: wxGetTranslation か、それと同じように _() マクロを利用してプログラム中のテキストを 翻訳する

source: Translating your application involves several steps:
ja: アプリケーションの翻訳にはいくつかのステップが含まれます:

source: Tries to detect the name of the user's default font encoding.
ja: ユーザのデフォルトのフォントエンコーディング名を検知しようと試みます。

source: Tries to detect the user's default font encoding.
ja: ユーザのデフォルトのフォントエンコーディングを検知しようと試みます。

source: Tries to make a connection with a server by host (machine name under UNIX - use 'localhost' for same ...
ja: ホスト (Unix ではマシン名です。同じマシンを指す場合は 'localhost' を使用してください; Windows ネイティブの DDE を使用するときは無視されます)、サービス名、トピック文字列を使用してサーバへの接続を試みます。

source: Try to write code so it is parameterised by wxDC - if you do this, the same piece of code may write to a number of different devices, by passing a different device context.
ja: なるべく wxDC 型を使用してパラメータ化するようにしてください。このようにした場合、異なるデバイスコンテキストを渡すことで多くのデバイスに対して同じコードを使用することができます。

source: Tuning wxString for Your Application
ja: wxString のチューニング

source: Typed, i.e. strings or numbers for the moment.
ja: 型を持つ。今のところ、文字列か数値であるべきです。

source: Typically events that deal with a window as a window (size, motion, paint, mouse, keyboard, etc.) are sent only to the window.
ja: (リサイズ、移動、描画、マウスイベント、キーボードイベントといった) ウィンドウに関係する一般的なイベントはウィンドウに対してのみ送られます。

source: Typically when UTF8 is used, code units are stored into char types, since char are 8bit wide on almost all systems; when using UTF16 typically code units are stored into wchar_t types since wchar_t is at least 16bits on all systems.
ja: 一般的に、UTF8 を使用するときはコード単位を char に格納します。なぜなら、ほぼすべてのシステムで char 型は 8 ビットの大きさを持つためです; そして、一般的に UTF-16 を使用するときはコード単位を wchar_t 型に格納します。 wchar_t はすべてのプラットフォームで少なくとも 16 ビットだからです。
